{
    "batchcomplete": "",
    "continue": {
        "gsroffset": 10,
        "continue": "gsroffset||"
    },
    "query": {
        "pages": {
            "5042916": {
                "pageid": 5042916,
                "ns": 0,
                "title": "Canada",
                "index": 1,
                "extract": "Canada (/ˈkænədə/; French: [ka.na.dɑ]) is a country in the northern half of North America. Its ten provinces and three territories extend from the Atlantic to the Pacific and northward into the Arctic Ocean, covering 9.98 million square kilometres (3.85 million square miles), making it the world's second-largest country by total area and the fourth-largest country by land area. Canada's border with the United States is the world's longest land border. The majority of the country has a cold or severely cold winter climate, but southerly areas are warm in summer. Canada is sparsely populated, the majority of its land territory being dominated by forest and tundra and the Rocky Mountains."
            },
            "5873": {
                "pageid": 5873,
                "ns": 0,
                "title": "Canada Day",
                "index": 10,
                "extract": "Canada Day (French: Fête du Canada) is the national day of Canada. A federal statutory holiday, it celebrates the anniversary of the July 1, 1867, enactment of the Constitution Act, 1867 (then called the British North America Act, 1867), which united the three separate colonies of the Canada, Nova Scotia, and New Brunswick into a single Dominion within the British Empire called Canada. Originally called Dominion Day (French: Le Jour de la Confédération), the holiday was renamed in 1982, the year the Canada Act was passed. Canada Day celebrations take place throughout the country, as well as in various locations around the world, attended by Canadians living abroad."
            },
            "853642": {
                "pageid": 853642,
                "ns": 0,
                "title": "Canada Games",
                "index": 8,
                "extract": "The Canada Games (French: Jeux du Canada) is a high-level multi-sport event with a National Artists Program held every two years in Canada, alternating between the Canada Winter Games and the Canada Summer Games. Athletes are strictly amateur only, and represent their province or territory.\nThe Games were first held in 1967 in Quebec City as part of Canada's Centennial celebrations. For the first time in Canada's history, 1,800 athletes from 10 provinces and two territories gathered to compete in 15 sports. Under the Games motto \"Unity through Sport\", these first Canada Winter Games paved the way to what is now Canada's largest multi-sport competition for young athletes."
            },
            "6999": {
                "pageid": 6999,
                "ns": 0,
                "title": "Culture of Canada",
                "index": 9,
                "extract": "The culture of Canada is a term that embodies the artistic, culinary, literary, humour, musical, political and social elements that are representative of Canada and Canadians. Throughout Canada's history, its culture has been influenced by European culture and traditions, especially British and French, and by its own indigenous cultures. Over time, elements of the cultures of Canada's immigrant populations have become incorporated into mainstream Canadian culture. The population has also been influenced by American culture because of a shared language, proximity and migration between the two countries.\nCanada is often characterized as being \"very progressive, diverse, and multicultural\"."
            },
            "5192": {
                "pageid": 5192,
                "ns": 0,
                "title": "Geography of Canada",
                "index": 5,
                "extract": "The geography of Canada describes the geographic features of Canada, the world's second largest country in total area.\nSituated in northern North America (constituting 41% of the continent's area), Canada spans a vast, diverse territory between the North Pacific Ocean to the west and the North Atlantic Ocean to the east and the Arctic Ocean to the north (hence the country's motto \"From sea to sea\"), with the United States to the south (contiguous United States) and northwest (Alaska). Greenland is to the northeast; off the southern coast of Newfoundland lies Saint-Pierre and Miquelon, an overseas collectivity of France. Since 1925, Canada has claimed the portion of the Arctic between 60°W and 141°W longitude to the North Pole; however, this claim is contested. While the magnetic North Pole lies within the Canadian Arctic territorial claim as of 2011, recent measurements indicate it is moving towards Siberia."
            },
            "616255": {
                "pageid": 616255,
                "ns": 0,
                "title": "Government of Canada",
                "index": 6,
                "extract": "The Government of Canada, French: Gouvernement du Canada, or more formally Her Majesty's Government (French: Gouvernement de Sa Majesté), is the federal administration of Canada. It is based in the national capital of Ottawa, Ontario. The head of government is Prime Minister Justin Trudeau, whose party the Liberal Party of Canada won the majority of seats in the Canadian Parliament in the 2015 Canadian federal election.\nIn Canadian English, the term can mean either the collective set of institutions or specifically the Queen-in-Council. In both senses, the construct was established at Confederation—through the Constitution Act, 1867—as a federal constitutional monarchy, wherein the Canadian Crown acts as the core, or \"the most basic building block,\" of its Westminster-style parliamentary democracy."
            },
            "56504": {
                "pageid": 56504,
                "ns": 0,
                "title": "Monarchy of Canada",
                "index": 3,
                "extract": "The Monarchy of Canada is at the very core of both Canada's federal structure and Westminster-style of parliamentary and constitutional democracy. The monarchy is the foundation of the executive (Queen-in-Council), legislature (Queen-in-Parliament), and judiciary (Queen-on-the-Bench) in the federal and each provincial jurisdiction. The Canadian sovereign is the personification of the Canadian state and, as a matter of constitutional law, is Canada. The current Canadian monarch, since 6 February 1952, is Queen Elizabeth II. Royal succession is determined according to common and statute law, which stipulates the throne is inherited by the sovereign's eldest living, non-Catholic child or, in the case of a childless sovereign, the nearest collateral line. As such, Elizabeth's son, Prince Charles, is heir apparent."
            },
            "160112": {
                "pageid": 160112,
                "ns": 0,
                "title": "Order of Canada",
                "index": 7,
                "extract": "The Order of Canada (French: Ordre du Canada) is a Canadian national order, admission into which is the second highest honour for merit in the system of orders, decorations, and medals of Canada. It comes second only to membership in the Order of Merit, which is the personal gift of Canada's monarch.\nTo coincide with the centennial of Canadian Confederation, the three-tiered order was established in 1967 as a fellowship that recognizes the outstanding merit or distinguished service of Canadians who make a major difference to Canada through lifelong contributions in every field of endeavour, as well as the efforts by non-Canadians who have made the world better by their actions. Membership is accorded to those who exemplify the order's Latin motto, desiderantes meliorem patriam, meaning \"they desire a better country\", a phrase taken from Hebrews 11:16. The three tiers of the order are Companion, Officer, and Member; specific individuals may be given extraordinary membership and deserving non-Canadians may receive honorary appointment into each grade."
            },
            "16276970": {
                "pageid": 16276970,
                "ns": 0,
                "title": "Outline of Canada",
                "index": 4,
                "extract": "The following outline is provided as an overview of and topical guide to Canada:"
            },
            "40389": {
                "pageid": 40389,
                "ns": 0,
                "title": "Upper Canada",
                "index": 2,
                "extract": "The Province of Upper Canada (French: province du Haut-Canada) was a part of British Canada established in 1791 by the United Kingdom, in order to govern the central third of the lands in British North America and to accommodate Loyalist refugees of the United States after the American Revolution. The new province remained, for the next fifty years of growth and settlement, the colonial government of the territory.\nUpper Canada existed from 26 December 1791 to 10 February 1841 and generally comprised present-day Southern Ontario. The \"upper\" prefix in the name reflects its geographic position being closer to the headwaters of the Saint Lawrence River than that of Lower Canada (or present-day Quebec) to the northeast.\nUpper Canada included all of modern-day Southern Ontario and all those areas of Northern Ontario in the Pays d'en Haut which had formed part of New France, essentially the watersheds of the Ottawa River or Lakes Huron and Superior (excluding any lands within the watershed of Hudson Bay)."
            }
        }
    },
    "limits": { "extracts": 20 }
}